Repository: XLsn0w/Dumb-Cydia-Repository-Manager
Catalog: WEIPDCRM/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Django RQ
ar: قائمة انتظار المعالجة

source: New Package
ar: حزمة جديدة

source: Statistics
ar: المعلومات الإحصائية

source: About...
ar: حول..

source: No enabled package available.
ar: لا توجد حزمة متاحة

source: General
ar: مشترك

source: History
ar: التاريخ

source: Finished
ar: اكتمل

source: Unknown
ar: غير معروف

source: Failed
ar: فشل

source: Processing...
ar: يعالج..

source: Job
ar: وظيفة

source: The Build "<a href="{job_detail}">{obj}</a>" generating job has been added to the "<a href="{jobs}">high</a>" queue.
ar: بناء "<a href="{job_detail}">{obj}</a>" توليد وظيفة أضيف إلى "<a href="{jobs}">high</a>" طابور.

source: The Build "%s" generating job has been finished.
ar: بناء "%s" توليد وظيفة قد انتهى.

source: Appearance
ar: الشكل

source: Package
ar: الحزمة

source: Version
ar: الاصدار

source: Cydia
ar: سيديا

source: Common
ar: مشترك

source: Advanced
ar: متقدم

source: There is no active release. <a href="%s">Set current release as active release.</a>
ar: لا يوجد إصدار نشط. <a href="%s">تعيين الإصدار الحالي نشط

source: %s Source Icon
ar: %s أيقونة المصدر

source: Auto generated section icon package for %s.
ar: قم تلقائيًا بإنشاء حزم أيقونات الفئات للفئات المحددة %s.

source: Section icon package generating job has been added to the "<a href="%s">default</a>" queue.
ar: تمت إضافة مهمة إنشاء حزمة رمز الفئة "<a href="%s">default</a>" طابور.

source: Section icon package generating job has been finished.
ar: تم الانتهاء من إنشاء حزمة رمز القسم

source: Generate icon package for selected sections
ar: إنشاء حزمة رمز للأقسام المحددة

source: Current Site
ar: الموقع الحالي

source: Enabled
ar: تفعيل

source: Disabled
ar: الغاء التفعيل

source: Redis Status
ar: وضع Redis

source: Memcached Status
ar: حالة Memcached

source: Memcached Interval
ar: Memcached الفاصل

source: API Status
ar: وضع API

source: Theme
ar: الثيم

source: Static URL
ar: عنوان URL ثابت

source: Static Root
ar: عنوان Root ثابت

source: Resources URL
ar: الموارد URL

source: Resources Root
ar: الموارد Root

source: Upload Root
ar: رفع Root

source: Packages List
ar: قائمة الحزم

source: Display
ar: العرض

source: Social
ar: تواصل اجتماعي

source: Footer
ar: التذيل

source: Security
ar: الامان

source: Queue
ar: الطابور

source: Static
ar: ثابت

source: Upload
ar: رفع

source: Resource
ar: المصادر

source: Server
ar: الخادم

source: Frontend
ar: النهاية الامامية

source: Third-Party
ar: الطرف الثالث

source: Mark selected versions as enabled
ar: تحديد الإصدارات المحددة على أنها مفعله

source: Mark selected versions as disabled
ar: تحديد الإصدارات المحددة على أنها غير مفعل

source: Hash updating job has been added to the "high" queue.
ar: تمت إضافة مهمة تحديث التجزئة "high" المصدر.

source: Hash updating job has been finished.
ar: انتهى تحديث الوظيفة

source: Update hashes of selected versions
ar: تحديث الاصدارات المختارة

source: Basic
ar: الاساسي

source: Links
ar: الروابط

source: Compatibility
ar: التوافق

source: Maintainer
ar: المشرف

source: Author
ar: المؤلف

source: Sponsor
ar: الراعي

source: Platform
ar: المنصة

source: Relations
ar: مشابه

source: Other Relations
ar: علاقات أخرى

source: Storage
ar: المساحة

source: Hash
ar: منوع

source: Provider
ar: مزود

source: Make
ar: صنع

source: Development
ar: تطوير

source: Contact
ar: تواصل

source: File System
ar: نظام الملفات

source: Others
ar: اخرى

source: Build
ar: بناء

source: Builds
ar: بناء

source: Created At
ar: أنشئت في

source: Active Release
ar: الإصدار النشط

source: Job ID
ar: معرف الوظيفة

source: Job Finished
ar: انتهى

source: Details
ar: تفاصيل

source: Tell others what did you do this time before you rebuild the repository.
ar: "أخبر الآخرين بما فعلته هذه المرة قبل إعادة بناء المستودع

source: Not a Debian Package
ar: الحزمة ليس بنظام Debian

source: Malformed Debian Package
ar: الحزمة تالفة

source: Device Type
ar: نوع الجهاز

source: Device Types
ar: انواع الاجهزة

source: Descriptor
ar: الوصف

source: Example: iPhone 7 Plus
ar: مثال: iPhone 7 Plus

source: Subtype
ar: العنوان الفرعي

source: Example: iPhone9,2
ar: مثال: iPhone9,2

source: Example: A1661/A1784/A1785
ar: مثال: A1661/A1784/A1785

source: iOS Version
ar: iOS اصدار

source: iOS Versions
ar: iOS اصدارات

source: Example: 10.2
ar: مثال: 10.2

source: Example: 14C92/11A466
ar: مثال: 14C92/11A466

source: Packages
ar: الحزم

source: Name
ar: الاسم

source: Section
ar: القسم

source: Online Icon
ar: اختيار ايقونة

source: Description
ar: الوصف

source: Download Times
ar: مرات التحميل

source: Release
ar: اطلاق

source: Releases
ar: اطلاق

source: Origin
ar: الاصلي

source: This is used by Cydia as the name of the repository as shown in the source editor (and elsewhere). This should be a longer, but not insanely long, description of the repository.
ar: يستخدم هذا Cydia كاسم المستودع كما هو موضح في المصدرمحرر (وفي أي مكان آخر). يجب أن يكون هذا أطول ، لكن ليس بجنونوصف المستودع

source: Label
ar: المكتبة

source: On the package list screens, Cydia shows what repository and section packages came from. This location doesn't have much room, though, so this field should contain a shorter/simpler version of the name of the repository that can be used as a tag.
ar: "على شاشات قائمة الحزم ، تعرض Cydia المستودع والقسمجاءت الحزم من. هذا الموقع لا يحتوي على مساحة كبيرة ، لذلك هذايجب أن يحتوي الحقل على نسخة أقصر / أبسط من اسم المستودعالتي يمكن استخدامها كعلامة

source: Suite
ar: جناح

source: Just set this to "stable". This field might not be required, but who really knows? I, for certain, do not.
ar: على واجهة قائمة الحزمة ، ستعرض Cydia المستودع والفئة التي جاءت منها الحزمة. ومع ذلك ، فإن هذا البتلا يوجد مجال كبير للإعداد ، لذلك يجب أن يحتوي هذا الحقل على نسخة أقصر أو أبسط من اسم المستودع الذي يمكن استخدامه كعلامة.

source: stable
ar: مستقر

source: This is an arbitrary version number that nothing actually parses. I am going to look into seeing how required it is.
ar: فقط تحتاج إلى تعيين ل "stable" نعم ، الدور المحدد غير واضح.

source: Codename
ar: اسم الكود

source: In an "automatic" repository you might store multiple distributions of software for different target systems. For example: apt.saurik.com's main repository houses content both for desktop Debian Etch systems as well as the iPhone. This codename then describes what distribution we are currently looking for.
ar: في مستودع "تلقائي " ، يمكنك تخزين إصدارات متعددة للأنظمة المستهدفة المختلفة ، على سبيل المثال:"apt.saurik.com" يحتوي المستودع الرئيسي على إصدار سطح المكتب Debian Etch النظام و iPhone محتوى المنصة. هذا يصف الاسم الرمزي التوزيع الذي نبحث عنه حاليًا.

source: Architectures
ar: هندسة معمارية

source: To verify a repository is for the specific device you are working with APT looks in the release file for this list. You must specify all of the architectures that appear in your Packages file here. Again, we use darwin-arm for 1.1.x and iphoneos-arm for 2.x.
ar: فقط تحتاج إلى تعيين ل "iphoneos-arm" حسنا ، ممثل iOS منصة.

source: Components
ar: المكونات

source: Just set this to "main". This field might not be required, but who really knows? I, for certain, do not.
ar: فقط تحتاج إلى تعيين ل "main" الى.

source: On the package source screen a short description is listed of the repository. This description may eventually work similarly to that of a package (with a long/short variety and the aforementioned encoding), but for right now only the shorter description is displayed directly on the list.
ar: في قسم معلومات مصدر الحزمة ، يتم سرد وصف موجز للمستودع.

source: Keywords
ar: الكلمات المفتاحية

source: Separated by commas.
ar: مستخلص بواسطة

source: Repository Icon
ar: أيقونة المستودع

source: Support
ar: الدعم

source: Official site to provide support.
ar: الموقع الرسمي لتقديم الدعم

source: E-mail
ar: البريد الالكتروني

source: Maintainer's E-mail to provide support.
ar: الاميل الخاص بالدعم الفني

source: Section name should not contain any underscore.
ar: يجب ألا يحتوي اسم القسم على أي شرطة سفلية

source: Sections
ar: الاقسم

source: This is a general field that gives the package a category based on the software that it installs. You will not be able to edit its name after assigning any package under it.
ar: هذا حقل عام يوفر فئة للحزم بناءً على البرنامج المثبت. قبل التعيين في أي برنامج بعد الحزمة ، لن تتمكن من تعديل اسمها.

source: Only these characters are allowed: 0-9A-Za-z_.-/
ar: يُسمح فقط بهذه الأحرف: 0-9A-Za-z _.- /

source: Path alias should be prefixed and suffixed by slash chars.
ar: يجب أن يبدأ الاسم المستعار للمسار بشرطة مائلة وينتهي بشرطة مائلة

source: Path alias should be suffixed by a slash char.
ar: يجب أن تكون لاحقة المسار باحرف مائلة

source: Cannot find command 'gpg': %s
ar: لا يمكن العثور على الأمر "gpg": %s

source: Only Nginx/Apache are supported now.
ar: فقط Nginx/Apache مدعوم الآن

source: pdiffs is not supported now.
ar: pdiffs غير معتمد الآن

source: Setting
ar: اعداد

source: Settings
ar: اعدادات

source: Each repository should have an active release, otherwise it will not be recognized by any advanced package tools.
ar: كل مخزن يتطلب التعريف النشط، وإلا لن يتم الاعتراف بها من قبل سيديا وغيرها من أدوات إدارة الحزم

source: Packages Compression
ar: ضغط الحزم

source: Plain
ar: عادي

source: All (Recommended)
ar: الجميع (مستحسن)

source: Packages Validation
ar: التحقق من صحة الحزم

source: No validation
ar: لم التحقق من الصحة

source: MD5Sum & SHA1 & SHA256 (Recommended)
ar: MD5Sum & SHA1 & SHA256 (مستحسن)

source: You need to update hashes manually.
ar: تحتاج إلى تحديث علامات الرقم يدويا

source: Downgrade Support
ar: يدعم الاصدارات السابقة

source: Allow multiple versions to exist in the latest package list.
ar: السماح بوجود إصدارات متعددة في أحدث قائمة حزم

source: Auto Depiction
ar: وصف تلقائي

source: Check it to generate awesome depiction page for each version.
ar: التحقق من ذلك لإنشاء صفحة تصوير رهيبة لكل إصدار

source: Atomic Storage
ar: المساحة المتوفرة

source: Generate a new copy of package after editing control columns.
ar: قم بإنشاء نسخة جديدة من الحزمة بعد تحرير أعمدة التحكم.

source: Resources Alias
ar: الاسم المستعار للمصدر

source: You can specify alias for resources path in Nginx or other HTTP servers, which is also necessary for CDN speedup.
ar: يمكنك تحديد اسم مستعار لمسار المورد المعين في Nginx أو وكيل HTTP عكسي آخر ، والذي يستخدم CDNفعالة جدا لتسريع مستوى الدليل.

source: Enable pdiffs
ar: تفعيل pdiffs

source: If package list is extremely large, you should enable this to allow incremental update.
ar: إذا كانت قائمة الحزم كبيرة جدًا ، فإن تمكينها سيسمح بتحديثات تدريجية إلى القائمة.

source: Enable Rest API
ar: تفعيل Rest API

source: Upload packages using HTTP, manage your repositories, snapshots and comments etc.
ar: يسمح لك باستخدام Restful API لتحميل الحزم ، وإدارة المستودعات ، لقطات الشاشة والتعليقات.

source: Enable GPG Signature
ar: تفعيل GPG Signature

source: Verify the integrity of the repository. Run 'gpg --gen-key' before you enable this feature.
ar: "اسمح لأداة إدارة الحزمة بالتحقق من سلامة هذا المستودع. قبل تمكين هذه الميزة ، يرجى تشغيل "gpg --gen-key".

source: This will help DCRM redirect download request properly. Only works when "Redirect Methods" is "Accel".
ar: اضبط إستراتيجية استجابة مورد حزمة توزيع DCRM.

source: Redirect Methods
ar: طرق إعادة التوجيه

source: None
ar: لاشيء

source: Moved
ar: نُقل

source: None - Read resources and return, without partical support, not recommended.<br />Moved - Return 301/302 responses and redirect to the real resource urls.<br />Accel - Redirect resource requests to WEB servers without changing urls.
ar: لا توجد موارد للقراءة والعودة ، لا تدعم Range back to source ، غير مستحسن. <br /> إعادة التوجيه - إرجاع 301/302الاستجابة للرأس وإعادة التوجيه إلى عنوان URL الخاص بالمورد الحقيقي ، والسماح لـ Nginx بإرجاع البيانات. <br /> عكس تسارع طلب الموردأبلغ الوكيل العكسي بالقراءة دون تغيير عنوان URL.

source: Redirect Prefix
ar: بادئة إعادة التوجيه

source: Changing scheme and host of the url in package downloading requests, which is useful for load balancing or CDN speedup. Only works when "Redirect Methods" is "Moved".<br /> Example: https://cdn.82flex.com/
ar: قم بتعديل المخطط ومضيف عنوان URL في طلب تنزيل الحزمة. هذا مفيد جدًا لموازنة التحميل وتسريع CDN.مساعدة رائعة. <br /> مثال: https://cdn.82flex.com/

source: Download Count
ar: عدد تحميل

source: Count every download. You should configure Nginx or other Web servers before you enable this feature.
ar: يعتبر كل تنزيل بمثابة عدد مرات التنزيل. قبل تمكين هذه الميزة ، يلزمك تكوين Nginx أو أي جيل عكسي آخر من HTTPلنجعل دليل الموارد غير ممكن الوصول إليه مباشرة ولكن نتعامل معه من خلال جانغو.

source: Protect downloading from any other tools except Cydia. You should configure Nginx or other Web servers before you enable this feature.
ar: قم بحماية دليل الموارد ولا تسمح بوصول وكلاء المستخدم بخلاف Cydia. قبل تمكين هذه الميزة ، تحتاج إلى تكوينه بشكل صحيحNginx أو وكيل HTTP العكسي الآخر يجعل دليل المورد غير قابل للوصول مباشرة ولكن يتم معالجته بواسطة Django.

source: Comments
ar: التعليقات

source: Enable comments module
ar: تفعيل التعليقات

source: Enable social module
ar: تفعيل التواصل الاجتماعي

source: Display "Donate via Paypal" link on the package info page.
ar: إظهار الرابط "التبرع عبر Paypal " في صفحة تفاصيل الحزمة.

source: Starting Year of Copyright
ar: بداية سنة حقوق النشر

source: Leave blank to display current year.
ar: اتركه فارغا لعرض السنة الحالية.

source: Copyright Name
ar: اسم حقوق الطبع والنشر

source: Corpyright name is displayed on the footer, leave a blank will display the source name.
ar: يتم عرض اسم حقوق التأليف والنشر على تذييل الصفحة ، اترك فارغا سيعرضاسم المصدر.

source: Version History
ar: تاريخ النسخة

source: Enable version history module
ar: تمكين إصدار وحدة التاريخ

source: Favicon
ar: مفضلة

source: Notice
ar: تنويه

source: HTML Displayed on the frontend widget and the auto depiction page (mobile).
ar: يتم عرض محتوى HTML المخصص في منطقة المكون العائمة الأمامية.

source: Advertisement
ar: الإعلانات

source: External Statistics
ar: الاحصائيات الخارجية

source: Invisible statistic code.
ar: كود إحصائي غير مرئي.

source: Internal Statistics
ar: الاحصائيات الداخلية

source: Statistics code of view information at statistics page.
ar: إحصائيات رمز عرض المعلومات في صفحة الإحصاءات.

source: We recommend using a reverse-domain name style string (i.e., com.domainname.appname).
ar: نوصي باستخدام سلسلة نمط اسم المجال العكسي (أي com.domainname.اسم التطبيق).

source: Invalid version number.
ar: رقم الإصدار غير صالح

source: Name cannot contain < or >.
ar: لا يمكن أن يحتوي الاسم < or >.

source: Cannot parse package relationship "%s"
ar: لا يمكن تحليل علاقة الحزمة "%s"

source: Enter a valid url of the bug tracking system.
ar: أدخل عنوان url صالحًا لنظام تتبع الأخطاء.

source: Versions
ar: إصدارات

source: OS Compatibility
ar: توافق مع الانظمة

source: Device Compatibility
ar: التوافق مع الاجهزة

source: Update Logs
ar: قائمة التحديثات

source: If there is no "Online Icon", this field will be taken.
ar: في حالة عدم وجود "رمز الإنترنت " ، سيتم استخدام هذا الحقل.

source: Size
ar: الحجم

source: The exact size of the package, in bytes.
ar: حجم الحزمة بوحدة البايت

source: Installed-Size
ar: حجم التثبيت

source: The approximate total size of the package's installed files, in KiB units.
ar: الحجم الكلي التقريبي لملفات الحزمة المثبتة ، بوحدات KiB.

source: This is the "identifier" of the package. This should be, entirely in lower case, a reversed hostname (much like a "bundleIdentifier" in Apple's Info.plist files).
ar: هذا هو " معرّف "الحزمة. كل صغيرة ، اسم مضيف للطلب العكسي (يشبه إلى حد كبير Info.plist من Apple)"bundleIdentifier") في الملف.

source: A package's version indicates two separate values: the version of the software in the package, and the version of the package itself. These version numbers are separated by a hyphen.
ar: يمثل إصدار الحزمة قيمتين منفصلتين: إصدار التطبيق الموجود في الحزمة وإصدار الحزمة نفسها. هذايتم فصل بعض أرقام الإصدار بالواصلات.

source: It is typically the person who created the package, as opposed to the author of the software that was packaged.
ar: بشكل عام ، هذا هو اسم منشئ الحزمة ، وليس مؤلف علم الوجود البرمجي للبرنامج.

source: Maintainer Email
ar: البريد الإلكتروني للحافظ

source: The first line (after the colon) should contain a short description to be displayed on the package lists underneath the name of the package. Optionally, one can choose to replace that description with an arbitrarily long one that will be displayed on the package details screen.
ar: يجب أن يحتوي السطر الأول (بعد النقطتين) على وصف قصير ، والذي سيظهر أسفل اسم إدخال الحزمة. أوأيضًا ، يمكنك اختيار استخدام وصف بأي طول ، والذي سيتم عرضه في صفحة تفاصيل الحزمة.

source: Rich Description
ar: الوصف الكامل

source: HTML Displayed on the auto depiction page (mobile).
ar: HTML يتم عرضه على صفحة الوصف التلقائي (الجوال).

source: Under the "Install" tab in Cydia, packages are listed by "Section". If you would like to encode a space into your section name, use an underscore (Cydia will automatically convert these).
ar: ضمن علامة التبويب " التثبيت "في Cydia ، يتم سرد الحزم حسب " الفئة ". إذا كنت ترغب في تشفير المسافات إلىفي الاسم ، استخدم الشرطة السفلية (Cydia ستحول هذه المسافات تلقائيًا).

source: Tag
ar: الاشارات

source: List of tags describing the qualities of the package. The description and list of supported tags can be found in the debtags package.
ar: قائمة العلامات التي تصف خصائص الحزمة.

source: This describes what system a package is designed for, as .deb files are used on everything from the iPhone to your desktop computer. The correct value for iPhoneOS 1.0.x/1.1.x is "darwin-arm". If you are deploying to iPhoneOS 1.2/2.x you should use "iphoneos-arm".
ar: فقط قم بتعيينها على "iphoneos-arm"، والتي تمثل منصة iOS.

source: When the package is shown in Cydia's lists, it is convenient to have a prettier name. This field allows you to override this display with an arbitrary string. This field may change often, whereas the "Package" field is fixed for the lifetime of the package.
ar: عندما يتم عرض حزمة في قائمة Cydia ، من المريح أن يكون لديك اسم جميل. هذا الحقل يتيح لك استخدام أيٍّ منهماسلسلة المعنى تحل محل الاسم الأصلي للحزمة للعرض. يمكن تغيير هذا الحقل بشكل متكرر ، في حين أن حقل" المعرف "ثابت طوال حياة الحزمة.

source: Untitled Package
ar: حزمة بدون عنوان

source: In contrast, the person who wrote the original software is called the "author". This name will be shown underneath the name of the package on the details screen. The field is in the same format as "Maintainer".
ar: المؤلف الأصلي للتطبيق الموجود في الحزمة يسمى " المؤلف "، وسيتم عرض اسم المؤلف في حزمة صفحة التفاصيلمباشرة أسفل الاسم.

source: Author Email
ar: اميل الكاتب

source: Finally, there might be someone who is simply providing the influence or the cash to make the package happen. This person should be listed here in the form of "Maintainer" except using a resource URI instead of an e-mail address.
ar: في النهاية ، قد يقدم شخص ما نفوذا أو موارد مالية لتسهيل إصدار الحزمة.

source: Sponsor Site
ar: موقع الراعي

source: Depiction
ar: وصف

source: This is a URL that is loaded into an iframe, replacing the Description: and Homepage: .
ar: هذا هو عنوان URL الذي تم تحميله في iframe ، ليحل محل الوصف: والصفحة الرئيسية:.

source: Custom Depiction
ar: وصف مخصص

source: Exclude this version from Auto Depiction feature.
ar: استبعد هذا الإصدار من ميزة "التصوير التلقائي".

source: Homepage
ar: الصفحة الرئيسية

source: Cydia supports a "More Info" field on the details screen that shunts users off to a website of the packager's choice.
ar: تدعم Cydia حقل "مزيد من المعلومات" على شاشة التفاصيل التي تنقل المستخدمين إلى موقع ويب من اختيار الرابط.

source: Priority
ar: الخصوصية

source: Sets the importance of this package in relation to the system as a whole. Common priorities are required, standard, optional, extra, etc.
ar: يحدد أهمية هذه الحزمة بالنسبة للنظام ككل. الأولويات المشتركة مطلوبة ، قياسية ، اختيارية ، إضافية ، إلخ.

source: Essential
ar: أساسى

source: This field is usually only needed when the answer is yes. It denotes a package that is required for proper operation of the system. Dpkg or any other installation tool will not allow an Essential package to be removed (at least not without using one of the force options).
ar: عادة ما تكون هناك حاجة لهذا الحقل فقط عندما يكون الجواب نعم. يشير إلى الحزمة المطلوبة للتشغيل السليم للنظام. لن يسمح Dpkg أو أي أداة تثبيت أخرى بإزالة الحزمة الأساسية (على الأقل ليس دون استخدام أحد خيارات القوة).

source: Depends
ar: يعتمد على

source: List of packages that are required for this package to provide a non-trivial amount of functionality. The package maintenance software will not allow a package to be installed if the packages listed in its Depends field aren't installed (at least not without using the force options). In an installation, the postinst scripts of packages listed in Depends fields are run before those of the packages which depend on them. On the opposite, in a removal, the prerm script of a package is run before those of the packages listed in its Depends field.
ar: قائمة الحزم المطلوبة لهذه الحزمة لتوفير كمية غير تافهة من الوظائف. لن يسمح برنامج صيانة الحزمة بتثبيت الحزمة إذا لم يتم تثبيت الحزم المدرجة في حقل Depends (على الأقل ليس دون استخدام خيارات القوة). في التثبيت ، يتم تشغيل البرامج النصية postinst للحزم المدرجة في الحقول Depends قبل تلك الحزم التي تعتمد عليها. على العكس ، في الإزالة ، يتم تشغيل البرنامج النصي prerm لحزمة قبل تلك الحزم المدرجة في حقل Depends.

source: Pre-Depends
ar: قبل الاعتماد

source: List of packages that must be installed and configured before this one can be installed. This is usually used in the case where this package requires another package for running its preinst script.
ar: قائمة الحزم التي يجب تثبيتها وتكوينها قبل أن يتم تثبيت هذه الحزمة. يستخدم هذا عادةً في الحالة التي تتطلب فيها هذه الحزمة حزمة أخرى لتشغيل البرنامج النصي preinst.

source: Recommends
ar: ينصح به

source: Lists packages that would be found together with this one in all but unusual installations. The package maintenance software will warn the user if they install a package without those listed in its Recommends field.
ar: يسرد الحزم التي يمكن العثور عليها مع هذا واحد في جميع المنشآت باستثناء غير عادية. سوف يحذر برنامج صيانة الحزمة المستخدم إذا قام بتثبيت حزمة دون تلك المدرجة في حقل "التوصية".

source: Suggests
ar: اقترح

source: Lists packages that are related to this one and can perhaps enhance its usefulness, but without which installing this package is perfectly reasonable.
ar: يسرد الحزم المرتبطة بهذه الحزمة والتي يمكن أن تعزز فائدتها ، ولكن بدونها يكون تثبيت هذه الحزمة معقولًا تمامًا.

source: Breaks
ar: فواصل

source: Lists packages that this one breaks, for example by exposing bugs when the named packages rely on this one. The package maintenance software will not allow broken packages to be configured; generally the resolution is to upgrade the packages named in a Breaks field.
ar: يسرد الحزم التي يكسرها هذا ، على سبيل المثال عن طريق الكشف عن الأخطاء عندما تعتمد الحزم المسماة على هذه الحزمة. لن يسمح برنامج صيانة الحزمة بتكوين الحزم المعطلة ؛ بشكل عام ، الدقة هي ترقية الحزم المسماة في حقل فواصل.

source: Conflicts
ar: النزاعات

source: Lists packages that conflict with this one, for example by containing files with the same names. The package maintenance software will not allow conflicting packages to be installed at the same time. Two conflicting packages should each include a Conflicts line mentioning the other.
ar: يسرد الحزم التي تتعارض مع هذه الحزمة ، على سبيل المثال عن طريق احتواء الملفات التي تحمل نفس الأسماء. لن يسمح برنامج صيانة الحزمة بتثبيت حزم متعارضة في نفس الوقت. يجب أن تتضمن كلتا الحزمتين المتعارضتين خطًا تعارضًا يذكر الآخر.

source: Replaces
ar: يستبدل
