Repository: XLsn0w/Dumb-Cydia-Repository-Manager
Catalog: WEIPDCRM/locale/*/LC_MESSAGES/django.po
Languages: ar

source: List of packages files from which this one replaces. This is used for allowing this package to overwrite the files of another package and is usually used with the Conflicts field to force removal of the other package, if this one also has the same files as the conflicted package.
ar: قائمة ملفات الحزم التي يستبدل منها هذا. يستخدم هذا للسماح لهذه الحزمة بالكتابة فوق ملفات حزمة أخرى وعادةً ما يتم استخدامه مع حقل Conflicts لفرض إزالة الحزمة الأخرى ، إذا كان هذا الملف يحتوي أيضًا على نفس ملفات الحزمة المتعارضة.

source: Provides
ar: يوفر

source: This is a list of virtual packages that this one provides. Usually this is used in the case of several packages all providing the same service. For example, sendmail and exim can serve as a mail server, so they provide a common package ("mail-transport-agent") on which other packages can depend. This will allow sendmail or exim to serve as a valid option to satisfy the dependency. This prevents the packages that depend on a mail server from having to know the package names for all of them, and using '|' to separate the list.
ar: هذه قائمة بالحزم الافتراضية التي توفرها هذه الحزمة. عادة ما يتم استخدام هذا في حالة وجود عدة حزم تقدم جميعها نفس الخدمة. على سبيل المثال ، يمكن أن يعمل mailmail و exim كخادم بريد ، بحيث يوفران حزمة مشتركة ("mail-transport-agent") يمكن أن تعتمد عليها الحزم الأخرى. سيسمح هذا mailmail أو exim ليكون بمثابة خيار صالح لتلبية التبعية. هذا يمنع الحزم التي تعتمد على خادم البريد من معرفة أسماء الحزم لجميعها ، واستخدام "|" لفصل القائمة.

source: The name of the distribution this package is originating from.
ar: اسم التوزيع هذه الحزمة هو الأصل من.

source: Source
ar: المصدر

source: The name of the source package that this binary package came from, if it is different than the name of the package itself. If the source version differs from the binary version, then the source-name will be followed by a source-version in parenthesis.
ar: اسم الحزمة المصدر التي جاءت منها هذه الحزمة الثنائية ، إذا كان مختلفًا عن اسم الحزمة نفسها. إذا كان الإصدار المصدر يختلف عن الإصدار الثنائي ، فسيتبع اسم المصدر إصدار مصدر بين قوسين.

source: Build-Essential
ar: بناء الأساسية

source: This field is usually only needed when the answer is yes, and is commonly injected by the archive software. It denotes a package that is required when building other packages.
ar: عادة ما تكون هناك حاجة لهذا الحقل فقط عندما تكون الإجابة نعم ، ويتم حقنه عادةً بواسطة برنامج الأرشيف. يشير إلى الحزمة المطلوبة عند إنشاء حزم أخرى.

source: Subarchitecture
ar: العمارة الفرعية

source: Kernel-Version
ar: Kernel-اصدار

source: This field specifies a whitespace separated list of build profiles that this binary packages was built with.
ar: يحدد هذا الحقل قائمة ملفات تعريف البناء المفصولة بمسافة بيضاء والتي تم بناء هذه الحزم الثنائية عليها.

source: Gallery
ar: المعرض

source: You can manage screenshots in Photologue.
ar: يمكنك إدارة لقطات الشاشة في Photologue.

source: Delete
ar: مسح

source: Build Now
ar: البناء الان

source: Build Active Release
ar: بناء الإصدار النشط

source: List of iOS Devices
ar: قائمة أجهزة iOS

source: Home
ar: الرئيسية

source: Help
ar: المساعدة

source: About DCRM
ar: حول DCRM

source: Cache Status
ar: حالة Cache

source: Database Status
ar: حالة قاعدة البيانات

source: Repository Statistics
ar: Repo احصائية ال

source: Are you sure to clean temporarily files and caches?
ar: هل أنت متأكد من تنظيف ذاكرة التخزين المؤقت؟

source: Fail to cleanup temporarily files and caches: error messages wrote to console.
ar: فشل في تنظيف ذاكرة التخزين المؤقت ، تمت كتابة رسالة خطأ إلى وحدة التحكم

source: View on site
ar: عرض الوقع

source: iOS Version History
ar: تاريخ اصدار IOS

source: Repository Format
ar: صيغة Repository

source: Upload New Package
ar: رفع حزمة جديدة

source: Exception:
ar: استثناء

source: An error occured.
ar: حدث خطأ.

source: Service Unavailable.
ar: الخدمة غير متوفرة.

source: Invalid Job.
ar: وظيفة غير صالحة.

source: Uploading...
ar: يتم الرفع ..

source: Service Unavailable:
ar: الخدمة غير متوفرة:

source: Operation Completed.
ar: اكتملت العملية.

source: Only Debian Package (*.deb) is allowed.
ar: الحزم فقط بصيغة (*.deb)

source: Drop Here!
ar: افلت هنا

source: Too many files.
ar: الكثير من الملفات.

source: Screenshots
ar: لقطات الشاشة

source: Upload Screenshots
ar: رفع لقطات الشاشة

source: Back
ar: الخلف

source: Unsupported file extension.
ar: امتداد الملف غير مدعوم

source: Upload Screenshot
ar: رفع لقطة الشاشة

source: About Deb-Control
ar: حول Deb-Control

source: Add %(name)s
ar: اضافة %(name)s

source: Bad Request
ar: طلب سيء

source: Not Found
ar: غير موجود

source: Internal Server Error
ar: خطأ في الخادم الداخلي

source: About
ar: حول

source: Clean
ar: تنظيف

source: Upload failed, unsupported file extension.
ar: أخفق الرفع ، ملحق الملف غير مدعوم

source: Upload succeed, proceeding...
ar: نجح الرفع , تتم المعالجة

source: Upload failed, invalid form.
ar: فشل الرفع ، نموذج غير صالح.

source: Upload New Packages
ar: تحميل حزمة جديدة
